本文介绍K-means算法在R语言中如何使用。

数据集

采用R语言内置的iris数据集。

#查看数据集前六个观测
head(iris)

K-means算法R语言实践
############################################################################################


第一步：加载R包
############################################################################################

library(stats)#该包属于默认包，会自动加载
 

第二步：构建K-means聚类模型
############################################################################################

model.Kmeans <-kmeans(x =subset(iris, select =-Species), centers=3)
 

第三步：生成混淆矩阵
############################################################################################

table(model.Kmeans$cluster, iris$Species)



K-means算法原理
############################################################################################


算法描述

输入：簇的数目k；包含n个对象的数据集D。

输出：k个簇的集合。

方法：

从D中任意选择k个对象作为初始簇中心；

repeat;

根据簇中对象的均值，将每个对象指派到最相似的簇；

更新簇均值，即计算每个簇中对象的均值；

计算准则函数；

until准则函数不再发生变化。

思考：K-means的优点和缺点？如何改进K-means算法？

